In [1]:
import pandas as pd

In [2]:
employees = pd.DataFrame({
    "EmpID": [1, 2, 3],
    "Name": ["Alice", "Bob", "Charlie"],
    "DeptID": [10, 20, 30]
})

departments = pd.DataFrame({
    "DeptID": [10, 20, 40],
    "DeptName": ["HR", "Engineering", "Marketing"]
})

In [3]:
pd.merge(employees,departments,on="DeptID")  #Inner Join And Which work on common DepartID

   EmpID   Name  DeptID     DeptName
0      1  Alice      10           HR
1      2    Bob      20  Engineering

In [4]:
pd.merge(employees,departments,on="DeptID",how = "left") # here left means that left side emplyoees 
                                                         # so aena badha coloum condier thay

   EmpID     Name  DeptID     DeptName
0      1    Alice      10           HR
1      2      Bob      20  Engineering
2      3  Charlie      30          NaN

In [5]:
pd.merge(employees,departments,on="DeptID",how ="right")#right side ma department che to aena 
                                                        #badha colum consider thay

   EmpID   Name  DeptID     DeptName
0    1.0  Alice      10           HR
1    2.0    Bob      20  Engineering
2    NaN    NaN      40    Marketing

In [6]:
pd.merge(employees,departments,on="DeptID",how ="outer")# badhi row and Coloum consider thay

   EmpID     Name  DeptID     DeptName
0    1.0    Alice      10           HR
1    2.0      Bob      20  Engineering
2    3.0  Charlie      30          NaN
3    NaN      NaN      40    Marketing